posts/2015-03-09-prayer-for-lent-3.org
#+date: <2015-03-09>
#+filetags: prayer religion
#+title: Prayer for Lent 3

*A prayer for reconciliation.*

God of love,

We open our arms\\
to hug and to hold,\\
welcome and invite.

With outstretched hands,\\
we lower our defenses\\
and accept the vulnerability\\
that comes with love.

Did the soldiers know\\
what they were doing\\
as they stretched the arms\\
of Jesus onto the cross?

Humiliated and scorned,\\
the Eternal King\\
chose vulnerability, love,\\
and reconciliation\\
instead of rejection.

Give us the courage\\
to do the same.

/Amen/


#+begin_tagline
Tagged: prayer religion
#+end_tagline
