docs/posts/2015-03-09-prayer-for-lent-3.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 30, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for Lent 3</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for Lent 3</h1>
<p class="subtitle" role="doc-subtitle">Mar 09, 2015</p>
</header><p>
<b>A prayer for reconciliation.</b>
</p>

<p>
God of love,
</p>

<p>
We open our arms<br>
to hug and to hold,<br>
welcome and invite.
</p>

<p>
With outstretched hands,<br>
we lower our defenses<br>
and accept the vulnerability<br>
that comes with love.
</p>

<p>
Did the soldiers know<br>
what they were doing<br>
as they stretched the arms<br>
of Jesus onto the cross?
</p>

<p>
Humiliated and scorned,<br>
the Eternal King<br>
chose vulnerability, love,<br>
and reconciliation<br>
instead of rejection.
</p>

<p>
Give us the courage<br>
to do the same.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org6f05e8e">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 30, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
